// 주석 한 줄 (single line comment)

/* 
여러 줄
주석 작성 (multi line comment)
CSS 주석과 유사

선택자 {
  속성: 값;
  속성: 값;
}
*/

// ------------------------------------------------
// 숫자 값 (number value or literal)
// ------------------------------------------------
// 실수
101.21
// 소수
0.871
// 정수
98
// 음수
-1.07

// ------------------------------------------------
// 문자(string) 값
// ------------------------------------------------
// 작은 따옴표(')
'2px'
// 큰 따옴표(")
// 프로그램 문장이 끝날 때 마침을 의미하는 세미콜론(;) 추가
"20mm";
// 역 따옴표(`, backtick)
`2inch`


// ------------------------------------------------
// 논리(boolean) 값
// - 진실 (Truthy, true)
// - 거짓 (Falsy, false)
// ------------------------------------------------

// ❌ 프로그램이 허용하지 않음 문자 (정의되지 않은)
//    - truthy
//    - falsy
//    - yes
//    - ok
//    - no

// ✅ 프로그램이 허용하는 불리언 값
true
false


// ------------------------------------------------
// 터미널 값 출력
// - 콘솔(Console) 기능(함수) 활용
// - '콘솔! 기록해줘(값)' 명령
// - console.log(값)
// ------------------------------------------------

// 숫자(number) 값 출력
console.log(9)

// 문자(string) 값 출력
console.log('자바스크립트 프로그램 (작은 따옴표)')
console.log("자바스크립트 프로그램 (큰 따옴표)")
console.log(`자바스크립트 프로그램 (역 따옴표)`)

// 논리(boolean) 값 출력
console.log(false)
console.log(true)